Joins are a fundamental operation in relational databases because they allow us to correlate and combine information across multiple tables. In this notebook, we will see some examples of different types of joins.

In [1]:
%load_ext sql
%sql postgresql://vagrant:vagrant@localhost/university

'Connected: vagrant@university'

In [2]:
%sql drop table if exists R1;
%sql drop table if exists R2;
%sql drop table if exists R3;
%sql create table R1 (A varchar(10), B int);
%sql insert into R1 values('alpha', 10), ('beta', 20), ('gamma', 20), ('rho', 30), ('psi', 50);
%sql create table R2 (B int, C varchar(10));
%sql insert into R2 values (10, 'one'), (20, 'two'), (40, 'three');
%sql create table R3 (C varchar(10), D varchar(10));
%sql insert into R3 values ('one', 'alpha'), ('two', 'beta');

 * postgresql://vagrant:***@localhost/university
Done.
 * postgresql://vagrant:***@localhost/university
Done.
 * postgresql://vagrant:***@localhost/university
Done.
 * postgresql://vagrant:***@localhost/university
Done.
 * postgresql://vagrant:***@localhost/university
5 rows affected.
 * postgresql://vagrant:***@localhost/university
Done.
 * postgresql://vagrant:***@localhost/university
3 rows affected.
 * postgresql://vagrant:***@localhost/university
Done.
 * postgresql://vagrant:***@localhost/university
2 rows affected.

[]

In [3]:
%sql select * from R3;

 * postgresql://vagrant:***@localhost/university
2 rows affected.

[('one', 'alpha'), ('two', 'beta')]

### Cartesian Product (Cross-product)
This is the most basic way to combine tuples across two tables. Every tuple in one relation is concatenated with every tuple from the other relation, so the result contains m * n tuples, where m and n are the number of tuples in the two relations. You almost never want to do cross product by itself, although there are some use cases.

Trying to do a cross-product with three relations will result in an every larger relation (see example below).

In [4]:
%sql select * from R1, R2;

 * postgresql://vagrant:***@localhost/university
15 rows affected.

[('alpha', 10, 10, 'one'),
 ('alpha', 10, 20, 'two'),
 ('alpha', 10, 40, 'three'),
 ('beta', 20, 10, 'one'),
 ('beta', 20, 20, 'two'),
 ('beta', 20, 40, 'three'),
 ('gamma', 20, 10, 'one'),
 ('gamma', 20, 20, 'two'),
 ('gamma', 20, 40, 'three'),
 ('rho', 30, 10, 'one'),
 ('rho', 30, 20, 'two'),
 ('rho', 30, 40, 'three'),
 ('psi', 50, 10, 'one'),
 ('psi', 50, 20, 'two'),
 ('psi', 50, 40, 'three')]

In [5]:
%sql select * from R1, R2, R3;

 * postgresql://vagrant:***@localhost/university
30 rows affected.

[('alpha', 10, 10, 'one', 'one', 'alpha'),
 ('alpha', 10, 20, 'two', 'one', 'alpha'),
 ('alpha', 10, 40, 'three', 'one', 'alpha'),
 ('alpha', 10, 10, 'one', 'two', 'beta'),
 ('alpha', 10, 20, 'two', 'two', 'beta'),
 ('alpha', 10, 40, 'three', 'two', 'beta'),
 ('beta', 20, 10, 'one', 'one', 'alpha'),
 ('beta', 20, 20, 'two', 'one', 'alpha'),
 ('beta', 20, 40, 'three', 'one', 'alpha'),
 ('beta', 20, 10, 'one', 'two', 'beta'),
 ('beta', 20, 20, 'two', 'two', 'beta'),
 ('beta', 20, 40, 'three', 'two', 'beta'),
 ('gamma', 20, 10, 'one', 'one', 'alpha'),
 ('gamma', 20, 20, 'two', 'one', 'alpha'),
 ('gamma', 20, 40, 'three', 'one', 'alpha'),
 ('gamma', 20, 10, 'one', 'two', 'beta'),
 ('gamma', 20, 20, 'two', 'two', 'beta'),
 ('gamma', 20, 40, 'three', 'two', 'beta'),
 ('rho', 30, 10, 'one', 'one', 'alpha'),
 ('rho', 30, 20, 'two', 'one', 'alpha'),
 ('rho', 30, 40, 'three', 'one', 'alpha'),
 ('rho', 30, 10, 'one', 'two', 'beta'),
 ('rho', 30, 20, 'two', 'two', 'beta'),
 ('rho', 30, 40, 'three', 'two', 'beta'),
 ('psi', 50, 10, 'one', 'one', 'alpha'),
 ('psi', 50, 20, 'two', 'one', 'alpha'),
 ('psi', 50, 40, 'three', 'one', 'alpha'),
 ('psi', 50, 10, 'one', 'two', 'beta'),
 ('psi', 50, 20, 'two', 'two', 'beta'),
 ('psi', 50, 40, 'three', 'two', 'beta')]

### StandardJoins (Theta Joins)
The standard way to do joins is by adding a selection predicate to the above queries. The predicate can pretty much be anything you want, although "equality" joins are most common.

In [6]:
%sql select * from R1, R2 where R1.B = R2.B;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('alpha', 10, 10, 'one'), ('beta', 20, 20, 'two'), ('gamma', 20, 20, 'two')]

In [7]:
%sql select * from R1, R2, R3 where R1.B = R2.B and R2.C = R3.C;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('alpha', 10, 10, 'one', 'one', 'alpha'),
 ('beta', 20, 20, 'two', 'two', 'beta'),
 ('gamma', 20, 20, 'two', 'two', 'beta')]

In [8]:
%sql select * from R1, R2 where R1.B < R2.B;

 * postgresql://vagrant:***@localhost/university
5 rows affected.

[('alpha', 10, 20, 'two'),
 ('alpha', 10, 40, 'three'),
 ('beta', 20, 40, 'three'),
 ('gamma', 20, 40, 'three'),
 ('rho', 30, 40, 'three')]

In [9]:
%sql select * from R1, R2 where R1.B + R2.B = 40;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('beta', 20, 20, 'two'), ('gamma', 20, 20, 'two'), ('rho', 30, 10, 'one')]

### Inner Join
The following is an alternate way to write a join query, using the keyword "inner join" -- as far as I know, the only reason to use it is stylistic. As we will see below, this style of writing queries is *essential* for outer-joins, and writing inner joins in this fashion may make things look similar.

In [10]:
%sql select * from R1 inner join R2 on R1.B = R2.B;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('alpha', 10, 10, 'one'), ('beta', 20, 20, 'two'), ('gamma', 20, 20, 'two')]

In [11]:
%sql select * from (R1 inner join R2 on R1.B = R2.B) inner join R3 on R2.C = R3.C;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('alpha', 10, 10, 'one', 'one', 'alpha'),
 ('beta', 20, 20, 'two', 'two', 'beta'),
 ('gamma', 20, 20, 'two', 'two', 'beta')]

### Natural Joins
A natural join is a type of inner join where the join condition is inferred by identifying common attributes in the two relations, and doing an equality on them. I personally prefer not to use them because they can lead to unexpected results if you are not careful.

**Note**: Unlike other types of joins, a natural join removes the extra occurrence of the join attribute (e.g., "b" below).

In [12]:
%sql select * from R1 natural join R2;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[(10, 'alpha', 'one'), (20, 'beta', 'two'), (20, 'gamma', 'two')]

In [13]:
%sql select * from R1 natural join R2 natural join R3;

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('one', 10, 'alpha', 'alpha'),
 ('two', 20, 'beta', 'beta'),
 ('two', 20, 'gamma', 'beta')]

### Outerjoins
In many cases, there is a need to keep all the tuples from one (or both) of the relations in the output, even if there is no match. **Outer joins** are used for that purpose. 

E.g., if I am doing a join between "department" and "instructor" on dept_name. Even if a department does not have any instructor, I might want the tuple to be present in the result output.

There are three types of outerjoins -- left, right, and full. 

The left outer join is shown below: any tuple from the left relation that did not have a corresponding tuple in the right relation, is added to the output with "NULLs" in the columns from the right relation (in this case, the tuple "rho 30" which did not appear in the join results above -- attribute b_1 and c which came from R2 are set to NULL).

In [14]:
%sql select * from R1 left outer join R2 on R1.B = R2.B;

 * postgresql://vagrant:***@localhost/university
5 rows affected.

[('alpha', 10, 10, 'one'),
 ('beta', 20, 20, 'two'),
 ('gamma', 20, 20, 'two'),
 ('rho', 30, None, None),
 ('psi', 50, None, None)]

**Right outer join** does the opposite, whereas a **full outer join** includes tuples from both relations that don't match.

In [15]:
%sql select * from R1 right outer join R2 on R1.B = R2.B;

 * postgresql://vagrant:***@localhost/university
4 rows affected.

[('alpha', 10, 10, 'one'),
 ('beta', 20, 20, 'two'),
 ('gamma', 20, 20, 'two'),
 (None, None, 40, 'three')]

In [16]:
%sql select * from R1 full outer join R2 on R1.B = R2.B;

 * postgresql://vagrant:***@localhost/university
6 rows affected.

[('alpha', 10, 10, 'one'),
 ('beta', 20, 20, 'two'),
 ('gamma', 20, 20, 'two'),
 ('rho', 30, None, None),
 (None, None, 40, 'three'),
 ('psi', 50, None, None)]

In [17]:
%sql select * from (R1 full outer join R2 on R1.B = R2.B) full outer join R3 on R2.C = R3.C;

 * postgresql://vagrant:***@localhost/university
6 rows affected.

[('alpha', 10, 10, 'one', 'one', 'alpha'),
 (None, None, 40, 'three', None, None),
 ('beta', 20, 20, 'two', 'two', 'beta'),
 ('gamma', 20, 20, 'two', 'two', 'beta'),
 ('rho', 30, None, None, None, None),
 ('psi', 50, None, None, None, None)]

### Semi-joins
Semi-join is not an explicit SQL keyword, but is a common Relational Algebra Operation (and has its own symbol). R1 semi-join R2 is simply the R1 tuples that have a match in R2. The output does not include any attributes from R2. 

The way to do this in SQL is through a subquery. As you can see, the tuple "rho, 30" does not appear because it does not have a match in R2.

In [18]:
%sql select * from R1 where R1.B in (select B from R2)

 * postgresql://vagrant:***@localhost/university
3 rows affected.

[('alpha', 10), ('beta', 20), ('gamma', 20)]

### Anti-join
Anti-join is the opposite concept -- it includes tuples from the left relation which DO NOT have a match in the right relation. So in this case, it will only include the "rho, 30" tuple.

Note that: R1 semi-join R2 and R1 anti-join R2 form a disjoint partition of R1.

In [19]:
%sql select * from R1 where R1.B not in (select B from R2)

 * postgresql://vagrant:***@localhost/university
2 rows affected.

[('rho', 30), ('psi', 50)]

### Summary
The figure below summarizes the different types of joins, the relational algebra notations for them, and the SQL equivalents.

<center><img src="https://github.com/umddb/cmsc424-fall2016/raw/master/project0/joins.jpg" width=600px></center>